const cardDataBangkok = [
  {
    id: 1,
    province:"กรุงเทพ (Bangkok)",
    title: "วัดพระแก้ว (The Temple of the Emerald Buddha)",
    description: "สถานที่สำคัญทางประวัติศาสตร์และศิลปะ เป็นศูนย์รวมสถาปัตยกรรมไทยชั้นสูงที่งดงามและประณีต",
    history: "วัดพระธาตุดอยสุเทพสร้างขึ้นในปี พ.ศ. 1929 ในสมัยพญากือนา กษัตริย์องค์ที่ 6 แห่งอาณาจักรล้านนา โดยมีเรื่องเล่าตามตำนานว่า พญากือนาได้อัญเชิญพระบรมสารีริกธาตุองค์ใหญ่ที่ได้มาจากสุโขทัยมาประดิษฐานไว้ในเมืองเชียงใหม่ แต่พระบรมสารีริกธาตุได้แสดงปาฏิหาริย์แยกออกเป็นสององค์ จึงได้อัญเชิญองค์หนึ่งไปบรรจุไว้ที่วัดสวนดอก และอีกองค์หนึ่งได้นำไปประดิษฐานบนหลังช้างมงคลเพื่อเสี่ยงทายหาที่ประดิษฐานใหม่ โดยช้างมงคลได้เดินขึ้นไปจนถึงยอดดอยแห่งนี้และร้องสามครั้งก่อนจะล้มลง พญากือนาจึงมีรับสั่งให้สร้างพระเจดีย์เพื่อบรรจุพระบรมสารีริกธาตุ ณ ที่แห่งนี้ และต่อมาจึงมีการสร้างบันไดนาคและบูรณะวัดมาอย่างต่อเนื่องในแต่ละยุคสมัยจนถึงปัจจุบัน",
    imageUrl: "/picture/วัดพระแก้ว.jpg"
  },
  {
    id: 2,
    province:"กรุงเทพ (Bangkok)",
    title: "พิพิธภัณฑสถานแห่งชาติพระนคร (Bangkok National Museum)",
    description: "พิพิธภัณฑ์ที่ใหญ่ที่สุดในประเทศไทย จัดแสดงโบราณวัตถุและงานศิลปะที่สำคัญตั้งแต่ยุคก่อนประวัติศาสตร์จนถึงปัจจุบัน",
    history: "พิพิธภัณฑสถานแห่งชาติพระนคร ตั้งอยู่ในบริเวณวังหน้า ซึ่งเคยเป็นที่ประทับของกรมพระราชวังบวรสถานมงคล (วังหน้า) ในสมัยรัตนโกสินทร์ตอนต้น พิพิธภัณฑ์แห่งนี้ก่อตั้งขึ้นในปี พ.ศ. 2417 ในสมัยพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว (รัชกาลที่ 5) เดิมชื่อ พิพิธภัณฑสถานสำหรับพระนคร โดยเป็นแหล่งรวบรวมโบราณวัตถุและศิลปวัตถุที่สำคัญของชาติ มีการจัดแสดงเรื่องราวทางประวัติศาสตร์และพัฒนาการของศิลปะไทยตั้งแต่ยุคก่อนประวัติศาสตร์จนถึงยุคปัจจุบัน",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999488469008504/9ecedd5d89af9ab3.jpg?ex=6895f498&is=6894a318&hm=1908b3bba6830c537e9162076d31a38393c5b23bb59825805f2cbc70d06641f8&=&format=webp"
  },
  {
    id: 3,
    province:"กรุงเทพ (Bangkok)",
    title: "หอศิลปวัฒนธรรมแห่งกรุงเทพมหานคร (Bangkok Art and Culture Centre - BACC)",
    description: "แหล่งรวมงานศิลปะร่วมสมัย มีการจัดนิทรรศการหมุนเวียนตลอดปี เป็นศูนย์กลางของคนรักศิลปะรุ่นใหม่",
    history: "หอศิลปวัฒนธรรมแห่งกรุงเทพมหานคร ก่อตั้งขึ้นจากความมุ่งมั่นที่จะเป็นศูนย์กลางทางศิลปะและวัฒนธรรมของเมือง โดยมีการวางแผนมาอย่างยาวนานตั้งแต่ช่วงปี พ.ศ. 2530 แต่เพิ่งเปิดอย่างเป็นทางการในปี พ.ศ. 2551 หอศิลป์แห่งนี้เป็นพื้นที่สาธารณะสำหรับจัดแสดงงานศิลปะร่วมสมัยทุกแขนง มีการจัดนิทรรศการหมุนเวียนตลอดปี และเป็นแหล่งพบปะของศิลปินและผู้ที่สนใจงานศิลปะ",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999505564995668/5482ec02a4d50456.jpg?ex=6895f49c&is=6894a31c&hm=4dc0da11dccd0a9e383be3fb420ab500489221cb2c834e20219f77996a08cd58&=&format=webp&width=1202&height=676"
  },
  {
    id: 4,
    province:"กรุงเทพ (Bangkok)",
    title: "ชุมชนกุฎีจีน (Kudi Chin Community)",
    description: "ชุมชนเก่าแก่ริมแม่น้ำเจ้าพระยาที่สะท้อนการผสมผสานของวัฒนธรรมสามศาสนา",
    history: "ชุมชนกุฎีจีนเป็นชุมชนเก่าแก่ที่ตั้งอยู่ริมแม่น้ำเจ้าพระยาฝั่งธนบุรี มีประวัติศาสตร์ยาวนานตั้งแต่สมัยสมเด็จพระเจ้าตากสินมหาราช ได้มีการอพยพชาวโปรตุเกสจากกรุงศรีอยุธยามาตั้งถิ่นฐานในบริเวณนี้ ทำให้เกิดการผสมผสานทางวัฒนธรรมที่หลากหลาย โดยมีโบสถ์ซางตาครู้สซึ่งเป็นศูนย์กลางของชาวคริสต์ ภายหลังยังมีชาวจีนและชาวมุสลิมเข้ามาตั้งรกราก ทำให้ชุมชนแห่งนี้เป็นศูนย์รวมของความหลากหลายทางศาสนาและวัฒนธรรมอย่างลงตัว",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999485956882503/67762745d9a976a9.jpeg?ex=6895f497&is=6894a317&hm=cd5e856d567cb8642d8103f7651a16d98493cdda631be35eaea02213add51cd8&=&format=webp&width=1014&height=676"
  },
];

const cardDataChiangMai = [
  {
    id: 5,
    province:"เชียงใหม่ (Chiang Mai)",
    title: "วัดพระธาตุดอยสุเทพราชวรวิหาร (Wat Phra That Doi Suthep)",
    description: "วัดสำคัญคู่เมืองเชียงใหม่ที่โดดเด่นด้วยสถาปัตยกรรมล้านนา และทิวทัศน์ที่สวยงามจากยอดดอย",
    history: "วัดพระธาตุดอยสุเทพสร้างขึ้นในปี พ.ศ. 1929 ในสมัยพญากือนา กษัตริย์องค์ที่ 6 แห่งอาณาจักรล้านนา จากตำนานเล่าว่ามีการอัญเชิญพระบรมสารีริกธาตุมาจากสุโขทัยและเสี่ยงทายหาที่ประดิษฐานบนหลังช้างมงคล ซึ่งช้างได้เดินขึ้นไปจนถึงยอดดอยแห่งนี้และล้มลง พญากือนาจึงมีรับสั่งให้สร้างพระเจดีย์เพื่อบรรจุพระบรมสารีริกธาตุ ณ ที่แห่งนี้",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999506655510548/64b3d5e1aa5be185.jpg?ex=6895f49c&is=6894a31c&hm=bf5766b31830e0b0c3986565b136937b280b0f9c345a29695556fee045d52dd9&=&format=webp&width=1012&height=676"
  },
  {
    id: 6,
    province:"เชียงใหม่ (Chiang Mai)",
    title: "หมู่บ้านทำร่มบ่อสร้าง (Borsang Umbrella Village)",
    description: "สถานที่ที่คุณจะได้เห็นและเรียนรู้กระบวนการทำร่มกระดาษสาอันเป็นเอกลักษณ์ของภาคเหนือ",
    history: "หมู่บ้านบ่อสร้างมีประวัติความเป็นมาเกี่ยวกับการทำร่มกระดาษสามาตั้งแต่สมัยโบราณ โดยเชื่อว่าพระภิกษุชาวไทยใหญ่รูปหนึ่งได้เดินทางกลับจากการธุดงค์และนำวิธีการทำร่มมาสอนให้แก่ชาวบ้านในยุคนั้น ชาวบ้านจึงได้ยึดอาชีพทำร่มและสืบทอดกันมาหลายชั่วอายุคนจนมีชื่อเสียงโด่งดังไปทั่วโลก",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999507754418176/20b4ee6493a5e202.jpg?ex=6895f49d&is=6894a31d&hm=9e7525ea41666d2a1216436e07f21de9e59c9356242d21533c743d95fdd94bb0&=&format=webp"
  },
  {
    id: 7,
    province:"เชียงใหม่ (Chiang Mai)",
    title: "บ้านถวาย (Ban Tawai)",
    description: "หมู่บ้านหัตถกรรมแกะสลักไม้ขึ้นชื่อของจังหวัดเชียงใหม่ เป็นแหล่งซื้อขายงานไม้แกะสลักและของตกแต่งบ้าน",
    history: "หมู่บ้านหัตถกรรมแกะสลักไม้บ้านถวายมีประวัติความเป็นมาตั้งแต่สมัยพุทธศตวรรษที่ 21 ซึ่งชาวบ้านในอดีตเริ่มทำอาชีพแกะสลักไม้เพื่อเป็นของใช้ในครัวเรือน และต่อมาได้ขยายเป็นงานหัตถกรรมที่ประณีตงดงามขึ้นเรื่อยๆ จนกลายเป็นศูนย์รวมการแกะสลักไม้ที่ใหญ่ที่สุดในจังหวัดเชียงใหม่และเป็นที่รู้จักไปทั่วโลก",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999487244533782/92bb78a9f18d572e.jpg?ex=6895f498&is=6894a318&hm=e0ac2ed866e7b14a8142af96afa8e94ea37ebb53006236799f70ba238785fb3c&=&format=webp"
  },
  {
    id: 8,
    province:"เชียงใหม่ (Chiang Mai)",
    title: "หอศิลปวัฒนธรรมเมืองเชียงใหม่ (Chiang Mai City Arts and Cultural Center)",
    description: "พิพิธภัณฑ์ที่รวบรวมประวัติศาสตร์ ศิลปะ และวัฒนธรรมของเมืองเชียงใหม่และอาณาจักรล้านนาไว้ครบถ้วน",
    history: "หอศิลปวัฒนธรรมเมืองเชียงใหม่ตั้งอยู่ในอาคารที่ทำการของศาลแขวงเชียงใหม่เดิม ซึ่งเป็นอาคารสถาปัตยกรรมแบบโคโลเนียลที่สร้างขึ้นในปี พ.ศ. 2470 ภายหลังได้มีการปรับปรุงอาคารแห่งนี้ให้เป็นพิพิธภัณฑ์ที่รวบรวมประวัติศาสตร์และวัฒนธรรมของเมืองเชียงใหม่และอาณาจักรล้านนาไว้เพื่อให้คนรุ่นใหม่ได้ศึกษา",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999507985240186/6a88dad86710b4d8.jpg?ex=6895f49d&is=6894a31d&hm=90d7e2baf57910c8b9874c0910a9c1adfedb029a676361fc80b9b7658307e077&=&format=webp"
  },
];

const cardDataAyutthaya = [
  {
    id: 9,
    province:"อยุธยา (Ayutthaya)",
    title: "อุทยานประวัติศาสตร์พระนครศรีอยุธยา (Ayutthaya Historical Park)",
    description: "มรดกโลกที่เต็มไปด้วยซากโบราณสถานของวัดและพระราชวังในอดีต สะท้อนถึงความรุ่งเรืองของอาณาจักรอยุธยา",
    history: "อุทยานประวัติศาสตร์ฯ ครอบคลุมพื้นที่ของเมืองหลวงในสมัยกรุงศรีอยุธยา ซึ่งเคยเป็นราชธานีที่รุ่งเรืองที่สุดแห่งหนึ่งของเอเชียระหว่างปี พ.ศ. 1893-2310 ภายหลังการเสียกรุงครั้งที่ 2 ในปี พ.ศ. 2310 พระราชวังและวัดวาอารามถูกทิ้งร้างและกลายเป็นซากปรักหักพัง จนกระทั่งได้รับการบูรณะและขึ้นทะเบียนเป็นมรดกโลกทางวัฒนธรรมโดย UNESCO ในปี พ.ศ. 2534",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999512385060906/ab0211d3c2118469.jpg?ex=6895f49e&is=6894a31e&hm=8871be131f2f774c16504e0e32c418fc9be69c288c4f260e40a1d79a8a43e5ca&=&format=webp"
  },
  {
    id: 10,
    province:"อยุธยา (Ayutthaya)",
    title: "วัดไชยวัฒนาราม (Wat Chaiwatthanaram)",
    description: "โบราณสถานที่โดดเด่นด้วยสถาปัตยกรรมแบบขอมที่งดงามริมแม่น้ำเจ้าพระยา และเป็นจุดถ่ายภาพที่ได้รับความนิยม",
    history: "วัดไชยวัฒนารามสร้างขึ้นในปี พ.ศ. 2173 ในสมัยสมเด็จพระเจ้าปราสาททอง เพื่ออุทิศถวายเป็นพระราชกุศลแด่พระราชมารดา และเป็นอนุสรณ์สถานแห่งชัยชนะทางสงคราม สถาปัตยกรรมของวัดได้รับอิทธิพลจากศิลปะขอมอย่างชัดเจน โดยมีปราสาทประธานล้อมรอบด้วยปรางค์บริวาร 8 องค์ ซึ่งสะท้อนคติความเชื่อในเรื่องจักรวาลตามแบบพุทธมหายาน",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999485163896882/75b31c2ae29d0bcd.jpg?ex=6895f497&is=6894a317&hm=c10434570f1d140fef46f6b2275f89ef275d399e03d042a0b40ccf8734d558aa&=&format=webp&width=901&height=676"
  },
  {
    id: 11,
    province:"อยุธยา (Ayutthaya)",
    title: "หมู่บ้านญี่ปุ่น (Japanese Village)",
    description: "แหล่งเรียนรู้ประวัติศาสตร์ความสัมพันธ์ระหว่างไทยกับญี่ปุ่นในสมัยอยุธยา มีการจัดแสดงเรื่องราวของชุมชนชาวญี่ปุ่นในอดีต",
    history: "หมู่บ้านญี่ปุ่นตั้งอยู่ในบริเวณที่เคยเป็นชุมชนของชาวญี่ปุ่นที่เข้ามาติดต่อค้าขายและตั้งถิ่นฐานในสมัยอยุธยาตอนกลางถึงตอนปลาย โดยในสมัยนั้นมีชาวญี่ปุ่นเข้ามาอยู่ในกรุงศรีอยุธยาจำนวนมาก โดยเฉพาะในสมัยพระเจ้าทรงธรรม ที่นี่เป็นแหล่งเรียนรู้ประวัติศาสตร์ความสัมพันธ์ระหว่างไทยกับญี่ปุ่น ซึ่งสะท้อนให้เห็นถึงการแลกเปลี่ยนทางวัฒนธรรมและการค้าที่ยาวนาน",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999507481792652/2dd956695f3f080b.jpg?ex=6895f49d&is=6894a31d&hm=a33044809f042856217b02725defd3f3c11e35e479b4ab7389f6b92e9f954638&=&format=webp"
  },
  {
    id: 12,
    province:"อยุธยา (Ayutthaya)",
    title: "ศูนย์ศิลปาชีพบางไทร (Bang Sai Royal Folk Arts and Crafts Centre)",
    description: "แหล่งเรียนรู้และศูนย์ฝึกอบรมศิลปหัตถกรรมไทยหลากหลายแขนง คุณจะได้ชมการสาธิตและเลือกซื้อสินค้าหัตถกรรมฝีมือประณีต",
    history: "ศูนย์ศิลปาชีพบางไทร ก่อตั้งขึ้นตามพระราชดำริของสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง เพื่อเป็นแหล่งฟื้นฟูและอนุรักษ์ศิลปหัตถกรรมพื้นบ้านของไทยให้คงอยู่ต่อไป มีการรวบรวมช่างฝีมือจากทั่วประเทศมาฝึกสอนและสร้างสรรค์งานหัตถกรรมไทยหลากหลายแขนง เพื่อสร้างงาน สร้างรายได้ และสืบทอดภูมิปัญญาไทยให้แก่คนรุ่นหลัง",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999507142316142/8e0a4cd1b4c6fa1a.jpg?ex=6895f49c&is=6894a31c&hm=5aa1be9dea08e3f54ef092489ad4af41e930603bacf05f1f6304e0895912e20f&=&format=webp&width=1448&height=555"
  },
];

const cardDataPhuket = [
  {
    id: 13,
    province:"ภูเก็ต (Phuket)",
    title: "ย่านเมืองเก่าภูเก็ต (Phuket Old Town)",
    description: "ย่านที่เต็มไปด้วยอาคารสไตล์ชิโน-โปรตุกีสสีสันสดใส สะท้อนประวัติศาสตร์การค้าและวัฒนธรรมอันเป็นเอกลักษณ์ของเมืองภูเก็ต",
    history: "ย่านเมืองเก่าภูเก็ตเกิดขึ้นจากการรุ่งเรืองของอุตสาหกรรมเหมืองแร่ดีบุกเมื่อกว่าร้อยปีที่แล้ว ซึ่งดึงดูดชาวต่างชาติโดยเฉพาะชาวจีนฮกเกี้ยนเข้ามาตั้งถิ่นฐานเพื่อทำงานในเหมืองดีบุกและค้าขาย ทำให้เกิดการผสมผสานทางวัฒนธรรมที่หลากหลาย อาคารบ้านเรือนในย่านนี้จึงถูกสร้างขึ้นด้วยสถาปัตยกรรมที่เรียกว่า ชิโน-โปรตุกีส ซึ่งเป็นการผสมผสานระหว่างศิลปะยุโรปและจีนอย่างลงตัว",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999488892768407/9c94e54009f9b8a8.jpg?ex=6895f498&is=6894a318&hm=9d4e8cf6b1ad6d34f44d3b2c3b7f55c1b5faf0b5c70e7048a47a66b895b48adc&=&format=webp&width=1014&height=676"
  },
  {
    id: 14,
    province:"ภูเก็ต (Phuket)",
    title: "พิพิธภัณฑ์ภูเก็ตไทยหัว (Thai Hua Museum)",
    description: "พิพิธภัณฑ์ที่จัดแสดงเรื่องราวของชาวจีนในภูเก็ต ตั้งแต่การอพยพ การทำเหมืองแร่ดีบุก และวิถีชีวิตในอดีต",
    history: "อาคารพิพิธภัณฑ์ภูเก็ตไทยหัวเดิมเป็นที่ตั้งของโรงเรียนสอนภาษาจีนแห่งแรกในจังหวัดภูเก็ต ที่มีชื่อว่า โรงเรียนไทยหัว สร้างขึ้นในปี พ.ศ. 2480 ภายหลังโรงเรียนได้ย้ายที่ทำการ อาคารแห่งนี้จึงได้รับการปรับปรุงให้เป็นพิพิธภัณฑ์ที่จัดแสดงประวัติศาสตร์ของชาวจีนในภูเก็ต ตั้งแต่การอพยพ การทำเหมืองแร่ดีบุก และวิถีชีวิตในอดีต",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999488032804884/ae3fb5a767a3ead9.jpeg?ex=6895f498&is=6894a318&hm=385a681124bd82717298794b1a2eff04cd5a67dd95f7d7d9324ad2fed86101e3&=&format=webp"
  },
  {
    id: 15,
    province:"ภูเก็ต (Phuket)",
    title: "บ้านชินประชา (Baan Chinpracha)",
    description: "คฤหาสน์สไตล์ชิโน-โปรตุกีสที่เปิดให้นักท่องเที่ยวเข้าชมความงามภายในบ้าน ซึ่งยังคงสภาพสมบูรณ์และจัดแสดงข้าวของเครื่องใช้ในอดีต",
    history: "บ้านชินประชาเป็นคฤหาสน์สไตล์ชิโน-โปรตุกีสหลังแรกๆ ของจังหวัดภูเก็ต สร้างขึ้นในปี พ.ศ. 2445 โดยพระพิทักษ์ชินประชา (ตันม่าเสียง) คหบดีชาวจีนผู้มีอิทธิพลในยุคนั้น บ้านแห่งนี้แสดงให้เห็นถึงความรุ่งเรืองของเหมืองแร่ดีบุกและเป็นสถาปัตยกรรมที่สะท้อนถึงวิถีชีวิตของครอบครัวชาวจีนที่ร่ำรวยในอดีต โดยปัจจุบันยังคงเป็นบ้านที่เปิดให้นักท่องเที่ยวเข้าชม",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999486787358830/d318e6ccb52a4d0e.jpg?ex=6895f498&is=6894a318&hm=0111f256973899b2c6333010722595d4e0bdb89acbc184ddfaf851be1f1c30b3&=&format=webp"
  },
  {
    id: 16,
    province:"ภูเก็ต (Phuket)",
    title: "วัดฉลอง (Wat Chalong)",
    description: "วัดคู่บ้านคู่เมืองของภูเก็ต มีสถาปัตยกรรมที่งดงาม และมีเรื่องราวทางประวัติศาสตร์ที่สำคัญต่อชาวภูเก็ต",
    history: "วัดฉลองเป็นวัดเก่าแก่คู่บ้านคู่เมืองของภูเก็ตมาตั้งแต่สมัยรัตนโกสินทร์ตอนต้น เดิมมีชื่อว่า วัดไชยธาราราม ซึ่งมีความเกี่ยวข้องกับประวัติศาสตร์การต่อสู้กับชาวอั้งยี่ (กลุ่มแรงงานจีน) ที่ก่อกบฏในสมัยพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว (รัชกาลที่ 5) มีเรื่องเล่าว่า หลวงพ่อแช่ม เจ้าอาวาสวัดในสมัยนั้น ได้ใช้ยันต์ช่วยคุ้มครองชาวบ้านจากการต่อสู้ ทำให้ชาวบ้านรอดปลอดภัยและนับถือท่านเป็นอย่างมาก",
    imageUrl: "https://media.discordapp.net/attachments/1402999385620611156/1402999505896607855/e23b623b8a26fd1b.jpg?ex=6895f49c&is=6894a31c&hm=bad581e81412375622519ed792469a1b1ce557f66f5c5046fbed28f88fa8dedb&=&format=webp"
  },
];

{/* รวม */}
const allCardData = [...cardDataBangkok, ...cardDataChiangMai, ...cardDataAyutthaya, ...cardDataPhuket];

allCardData.forEach(card => {
  if (card.id >= 1 && card.id <= 4) {
    card.location = 'bangkok';
  } else if (card.id >= 5 && card.id <= 8) {
    card.location = 'chiangmai';
  } else if (card.id >= 9 && card.id <= 12) {
    card.location = 'ayutthaya';
  } else if (card.id >= 13 && card.id <= 16) {
    card.location = 'phuket';
  }
});


export default allCardData;